
// Знайти суму 5 непарних чисел, що знаходяться між заданими користувачем числами.

/*
	Вводимо початок інтервалу.
	Вводимо кінець інтервалу.
	Вводимо змінну для лічильника не парних чисел.
	Вводимо змінну для обчислення суми 5 не парних чисел.
	Починаємо цикл for, щоб пройти по всім числа цього проміжку.
	В циклі робимо умову, якщо число не парне (залишок від ділення на нуль === 0) додаємо його до початкового значення суми, збільшуємо лічильник не парних чисел на 1 ,якщо лічильник не парних чисел більше 5 зупиняємо сумувати їх.
 */

if (confirm('Почати тестування ?')) {
	let min = parseInt(prompt('Введіть початкове значення інтервалу чисел', '')); // Вводимо початкове значення інтервалу чисел.
	let max = parseInt(prompt('Введіть кінцеве значення інтервалу чисел', ''));   // Вводимо кінцеве значення інтервалу чисел.

	let count = 0;  // Вводимо змінну лічильника не парних чисел та ініціалізуємо її.
	let oddSum = 0; // Вводимо змінну в яку буде сумуватись перші пять не парних чисел.
	const MAX_COUNT = 5; 

	if (min > max) {     // Вводимо умову на випадок коли в перше значення (min) буде записане більше значення чим в (max).
	const	helpVariable = min;  // Вводимо додаткову змінну для перестановки значень (min) та (max) місьцями.
		min = max;
		max = helpVariable;
	}

	for (let i = min; i <= max; i++) {
		if (i % 2 && count < MAX_COUNT) {
			oddSum += i;
			document.write(`<span style="color:red;">${i + ' '}</span>`);
			count++;
		}
		else {
			document.write(`<span>${i + ' '} </span>`);
		}
	}
	document.write('<table border="2px">')
	document.write('<tbody>')
	document.write('<tr>')
	document.write('<td>Сумма перших пяти не парних чисел</td>');
	document.write(`<td>${oddSum}</td>`);
	document.write('</tr>')
	document.write('</tbody>')
	document.write('</table>')

}
