
// Каса. Користувачу повідомляють суму, яку йому треба сплатити. Користувач поступово вводить суму грошей до тих пір, поки суми не буде достатньо для оплати товарів (кожного разу користувачу повідомляють, яку ще суму потрібно ввести). 

/*
 Ввести сумму грошей яку користувачу необхідно сплатити.
 Використати цикл (do While) в якому будемо вводити скільки грошей є у користувача ы порывнювати з необхідною суммою.
 Поставити умову якщо грошей не вистачає то виводити повідомлення скільки ще потрібно грошей. 
 */

if (confirm('Почати тестування ?', '')) {

	const totalMoney = parseInt(prompt('Вам необхідно сплатити..... грн.', ''));
	let userMoney = parseInt(prompt('Сумма грошей користувача', ''));
	let question;

	while (userMoney <= totalMoney) {
		if (userMoney < totalMoney) {
			question = confirm(`Вам необхідно внести ще ${totalMoney - userMoney}, чи є у вас ще стільки грошей?`);
		}
		if (question === true) {
			let addUserMoney = parseInt(prompt('Введіть додаткову кількість грошей ', ''));
			userMoney += addUserMoney;
		}
		else {
			document.write('У вас не вистачило грошей')
			break;
		}
	}
}