
// Вивести на екран N абзаців (N вводиться користувачем) за зразком:

// Запитати у користувача скільки абзаців вивести на єкран.

// задати лічильник для заголовків, розділів та параграфів. Лічильники для заголовків та розділів будуть співпадати.

// Створити цикл для створення <div></div> в якому будть заголовки <h1></h1>, параграфи <p></p>, горизонтальна лінія <hr>
// Кількість <div></div> буде = числу яке введе користувач

// В средині циклу для <div></div> вивести <h1></h1> та нумерації загаловків, цикл для створення параграфів та нумерації розділів та параграфів, збільшити лічильник для заголовків та параграфів . Вивести тег <hr>


let counterSection = 1; // Лічильник для заголовків та розділів

if (confirm('Почати тестування ?')) {
	const quantityBlock = parseInt(prompt('Введіть кількість абзаців', '')); // Введення кількості абзаців.

	for (let i = 1; i <= quantityBlock; i++)	{  // Початок циклу для створення <div></div>. Якщо конкретне число або кількість то беремо умову від "1" до "<=" чомусь в даному випадку числу яке ввів користувач. Якщо почати з "0" то на циклі наступному нічого не виведеться бо "і" буде менше за "j". А "<=" тому щоб рахувало "1""2""3" якщо "3" абзаца а не зупинялось на "2" 

		document.write(`<div class="paragraf">`);                 // Виводимо та відкриваємо тег <div>
	document.write(`<h1>Заголовок ${counterSection}</h1>`);   // Виводимо тег <h1></h1> з лічильником

	for (let j = 1; j <= i; j++) {       // Початок циклу для виведення тегу <p></p>. Кількість разів виведення задаємо початкове значення "j=1" тобто "1", поки "j" буде <="i", тобто який <div></div> за номером буде на цій ітерації така кількість параграфів і буде виведена. Значення "j" записуємо в якості лічильника параграфу. Це значення "j" після побудови <div></div> знову буде "= 1" і нумерація параграфів буде починатись з "1" до "який за рахунком абзац ми будуємо"
		document.write(`<p>Розділ ${counterSection}, параграф ${j}</p>`);   // Виведення тега <p></p>
	}
	document.write(`<hr>`);  // Горизонтальна лінія
	counterSection++;          // Збільшуємо лічильник заголовків та розділів
	document.write(`</div>`); // Закриваємо тег </div>
}

}