
// Вивести 3 таблиці (по 3 рядки і 3 стовпці у кожній) за зразком

if (confirm('Почати тестування ?')) {

	let caunter = 1;                 // Лічильник цифер в комірках (клітинках)

	for (let i = 0; i < 3; i++) {       // Задаємо цикл для утворення таблиць ( в кількості трьох штук)
		document.write(`<table>`);         // Відкриваємо тег утворення таблиці
		for (let tr = 0; tr < 3; tr++) {       // Задаємо цикл для утворення рядків ( в кількості трьох штук)
		document.write(`<tr>`);                // Відкриваємо тег утворення рядка ( буде три рядка)
			for (let td = 0; td < 3; td++) {       // Задаємо цикл для утворення комірок ( в кількості трьох штук)
				document.write(`<td>${caunter}</td>`);   // Відкриваємо тег утворення комірки ( буде три комірки) та записуємо туди значення лічильника
				caunter++;                                // Після виведення комірки зі значенням початкового лічильника збілльшуємо лічильник на "1"
			}
		}
		document.write(`</tr>`)                // Закриваємо тег утворення рядка
	}
	document.write(`</table>`);              // Закриваємо тег утворення таблиці
}