
// Користувач загадує число. За 3 спроби комп’ютер намагається вгадати число користувача (використати confirm).

// Ввести проміжок чисел в якому користувач загадує число.

if (confirm('Почати тестування ?', '')) {

// Вивести запит на те, щоб користувач загадав та записав число в казаних границях.
// Почати цикл в якому рандомним чином компютер буде видавати числа в казаних границях.
// запитати на кожній ітерації чи це число вірне.
//зробити перевірки чи користувач грає за правилами.

// Задаємо змінну яка буде мінімальною межею рандомного числа

let min = 1;      

// Задаємо змінну яка буде максимальною межею рандомного числа

let max = 5;

// Вводимо змінну "питання" яка буде виводити модальне вікно чи вірне число.

let questions;

// Виводимо модальне вікно з пропозицією загадати та записати число від "1" до "5"

let number = parseInt(prompt('Загадайте та напишіть число від 1 до 5', ''));

// Змінна для виведення модального вікна з результатом

let answer; 

// Змінна для додаткового тексту чи вірне це число чи ні при виведенні в кінці программи

// let addText = '';

document.write(`<table>`)         // Відкриваємо тег <table>
document.write(`<tbody>`)          // Відкриваємо тег <tbody>
for (let i = 1; i < 4; i++) {      // Починаємо цикл для утворення рядків <tr>, визначення рандомного числа, виведення модальних вікон
	document.write(`<tr>`)
		let randomNumber = min + Math.floor(Math.random()*(max - 1 + 1));   // Визначення рандомного числа
		questions = confirm(`Це число ${randomNumber} ? Якщо так нажміть "ОК", якщо ні нажміть "Відміна"`); // Виведення модального вікона з запитанням
		
		if (number !== randomNumber && questions === true)   // умова якщо загадане число не дорівнює рандомному і у відповідь буде натиснута кнопка "ОК",то виводимо повідомлення те яке далі по коду
		answer = alert(`Ви кажете не правду, компютер не вгадав число. За вами виїхала джава-скрипт поліція :)) `) // виведення модального вікна з повідомленням
		else
		if (questions === true && number === randomNumber) {    // інакше буде перевірятись умова якщо натиснута кнопка "ОК" і загадане число дорівнює рандомному то виведеться повідомлення далі по коду
			answer = confirm(`Компютер вгадав Ваше число, це число ${randomNumber}`);  // виведення модального вікна з повідомленням
		//  addText = `Це вірне число`
		 document.write(`<td> число яке використав компютер </td>`)    // Формуємо ячейку в рядку
		 document.write(`<td>${randomNumber}</td>`) 
		document.write(`<td> Це вірне число</td>`)     // Формуємо ячейку в рядку 
		// document.write(`<td>${addText}</td>`)
			break;                                                      // Прериваємо цикл якщо ця умова виконується
		}
		else
		if (number === randomNumber) {                    // Якщо число дорівнює рандомному але користувач натиснув "Відміна"
			// addText = `Це вірне число`
			answer = alert(`Ви кажете не правду, компютер вгадав число і це число ${randomNumber}. За вами виїхала джава-скрипт поліція :))`)
			 document.write(`<td> число яке використав компютер</td>`)
		 document.write(`<td>${randomNumber}</td>`) 
		document.write(`<td> Це вірне число</td>`)
		// document.write(`<td>${addText}</td>`)
		
			break;                       // Прериваємо цикл якщо ця умова виконується
		}
		else
		answer = alert('Компютер не вгадав Ваше число');            // Якщо жодна з умов не виконується то виводимо результати запитів
		// addText = `Це не вірне число`
		document.write(`<td> число яке використав компютер</td>`)
		document.write(`<td>${randomNumber}</td>`) 

		document.write(`<td> Це не вірне число</td>`)
		// document.write(`<td>${addText}</td>`)

	document.write(`</tr>`)
	}
	document.write(`<tr>
											<td>Число яке Ви загадали</td>
											<td>${number}</td>
									</tr>`)
	document.write(`</tbody>`)      // Закриваємо тег </tbody>
	document.write(`</table>`)        // Закриваємо тег </table>
}