
//  Користувач поступово вводить прибуток магазину за кожен день протягом N тижнів. Знайти загальну величину прибутку та вивести величину прибутку протягом кожного окремого тижня.

/*
Ввести кількість тижнів протягом яких буде проводитись розрахунок.
створити цикл кількістью повторень цих тижнів.
В середині нього створити цикл від "1" до "7" та вносити дані про прибуток кожного дня.
В середині цього циклу порахувати прибуток.
Порахувати прибуток в середині загального циклу.
 */

if (confirm('Почати тестування ?', '')) {

	const weekNumber = parseInt(prompt('Введіть кількість тижнів ', ''));
	let totalProfit = 0;
	let weekProfit;
	
	for (let i = 1; i <= weekNumber; i++) {
		weekProfit = 0;
		for (let j = 1; j <= 7; j++) {
			const dayProfit = parseInt(prompt(`Введіть прибуток за день ${j}`, ''));
			weekProfit += dayProfit;
		}
		document.write(`Прибуток магазину за ${i} тиждень ${weekProfit}<br>`);
		totalProfit += weekProfit;

	}
	document.write(`Прибуток магазину за ${weekNumber} тижні ${totalProfit}<br>`);
}