
// Вивести таблицю з 3 рядків і 7 стовпців

if (confirm ('Почати тестування ?')) {

	document.write(`<table>`)	 // Відкриваємо тег <table>
	document.write(`<tbody>`)	 // Відкриваємо тег <tbody>
	for (let tr = 1; tr < 4; tr++) {   // Починаємо цикл який будує рядок <tr></tr>
	 document.write(`<tr></tr>`)       // Виводимо цей рядок

		for (let td = 1; td < 8; td++) {   // Переходимо до заповнення тегу <td></td>
			document.write(`<td>${td}</td>`)  // Заповнюємо у один записаний рядок "7" значень, тобто створюємо сім комірок, потім переходимо до виконання першого циклу другої ітерації
		}
	}
	document.write(`</tbody>`)	 // Закриваємо тег </tbody>
	document.write(`</table>`)	// Закриваємо тег </table>
	
}